# coding=utf-8

'''
列表习题：
一 下面列表：
a = [1,2,3,4,5,333,11,44]
输出下面的结果：
[4,5,333]
'''
a = [1, 2, 3, 4, 5, 333, 11, 44]
print([a[3], a[4], a[5]])
print(a[3:6:1])

'''
二 有下面2个列表
a = [1,2,3]
b = [4,5,6]
用2个方法输出下面结果：
[1,2,3,4,5,6]
'''
a = [1, 2, 3]
b = [4, 5, 6]
print(id(a))
print(a + b)
a.extend(b)
print(id(a))
print(a)

'''
三 有下面2个列表：
a = [1,99,33,44,55,22]
输出结果:
1：[1,2,99,33,44,55,22,(11,33,54)]

2: [1,2,99,33,101,44,55,22]
'''
a = [1, 99, 33, 44, 55, 22]
a.append((11, 33, 54))
print(a)
a.insert(3, 101)
print(a)

'''
四：用列表推导式生成100内的大于20的偶数
'''
print([x for x in range(1, 101) if x % 2 == 0 and x >= 20])

'''
五：列表排序、列表反转
'''
a = [13, 4, 2, 5, 1, 9]
a.sort()
print(a)
a.reverse()
print(a)

'''
六：列表删除
'''
a = [2, 1, 5, 5, 3, 9]
del a[0]
print(a)

a.remove(5)
print(a)

a.pop()
print(a)
